import { execOnce } from "next/dist/shared/lib/utils";

export const questions = [
  {
    id: 1,
    question: "如何在企业微信中邀请新成员？?",
    options: [
      { id: "a", option: "在企业微信中登录，打开“设置”，点击“邀请新成员" },
      { id: "b", option: "在企业微信中登录，打开“聊天”，点击“添加成员" },
      { id: "c", option: "在企业微信中登录，打开“通讯录”，点击“添加成员" },
    ],
  },
  {
    id: 2,
    question: "如何在企业微信中发送消息？",
    options: [
      { id: "a", option: "在企业微信中登录，打开“设置”，点击“发送消息。" },
      { id: "b", option: "在企业微信中登录，打开“通讯录”，点击“发送消息。" },
      {
        id: "c",
        option:
          "在企业微信中登录，打开“聊天”，点击您想要发送消息的联系人，并在对话框中输入消息内容并发送。",
      },
    ],
  },
  {
    id: 3,
    question: "如何在企业微信中创建群聊？",
    options: [
      {
        id: "a",
        option:
          "在在企业微信中登录，打开“聊天”，点击“创建群聊”，选择要加入群聊的联系人，并点击“创建。",
      },
      { id: "b", option: "在企业微信中登录，打开“设置”，点击“创建群聊。" },
      { id: "c", option: "在企业微信中登录，打开“通讯录”，点击“创建群聊。" },
    ],
  },
  {
    id: 4,
    question: "如何在企业微信中上传文件？",
    options: [
      { id: "a", option: "在企业微信中登录，打开“文件”，点击“上传文件。" },
      { id: "b", option: "在企业微信中登录，打开“设置”，点击“上传文件。" },
      {
        id: "c",
        option:
          "3.在企业微信中登录，打开要发送文件的群聊或聊天窗口，点击“+”，选择“文件”，并选择要上传的文件。",
      },
    ],
  },
  {
    id: 5,
    question: "如何在企业微信中使用第三方应用？",
    options: [
      {
        id: "a",
        option: "点击企业微信的“设置”，在应用市场中搜索并安装第三方应用。",
      },
      { id: "b", option: "从其他网站下载第三方应用，然后在企业微信中安装。" },
      {
        id: "c",
        option: "直接在应用市场中搜索并下载第三方应用，然后在企业微信中安装。",
      },
    ],
  },
  {
    id: 6,
    question: "如何在企业微信中进行视频会议？",
    options: [
      { id: "a", option: "在企业微信中点击视频会议，并选择参与者。" },
      { id: "b", option: "在企业微信中打开摄像头，并通过麦克风进行通话。" },
      { id: "c", option: "在企业微信中点击电话会议，并选择参与者。" },
    ],
  },
  {
    id: 7,
    question: "如何在企业微信中进行文件共享？",
    options: [
      {
        id: "a",
        option: "在聊天窗口中点击文件按钮，选择要共享的文件，点击发送。",
      },
      {
        id: "b",
        option: "在聊天窗口中点击表情按钮，选择要共享的文件，点击发送。",
      },
      {
        id: "c",
        option:
          "在聊天窗口中点击文件按钮，选择要共享的文件，右键单击，选择共享文件。",
      },
    ],
  },
  {
    id: 8,
    question: "如何在企业微信中进行各项审批设置？",
    options: [
      { id: "a", option: "点击设置选项，在审批流程栏中设置。" },
      { id: "b", option: "通过第三方应用进行审批设置。" },
      { id: "c", option: "在群聊中进行审批设置。" },
    ],
  },
  {
    id: 9,
    question: "如何在企业微信中导出审批数据？",
    options: [
      { id: "a", option: "在“文件传输助手”中点击“导出”按钮。" },
      {
        id: "b",
        option:
          "在“审批”应用中选择要导出的审批流程，然后在右上角点击“导出”按钮",
      },
      { id: "c", option: "在“通讯录”中搜索“审批数据”，并点击“导出”按钮。" },
    ],
  },
  {
    id: 10,
    question: "如何在企业微信中创建Word文档？",
    options: [
      {
        id: "a",
        option: "打开企业微信应用，点击“文件”标签，选择“新建 Word 文档”。",
      },
      {
        id: "b",
        option:
          "在企业微信中直接打开 Microsoft Office 软件，并新建 Word 文档。",
      },
      { id: "c", option: "在企业微信中不能创建 Word 文档。" },
    ],
  },
  {
    id: 11,
    question: "如何在企业微信中创建Excel表格？",
    options: [
      {
        id: "a",
        option: "打开企业微信应用，点击“文件”标签，选择“新建 Excel 表格。",
      },
      {
        id: "b",
        option:
          "在企业微信中直接打开 Microsoft Office 软件，并新建 Excel 表格。",
      },
      { id: "c", option: "在企业微信中不能创建 Excel 表格。" },
    ],
  },
  {
    id: 12,
    question: "如何在企业微信中使用实时语音通话？",
    options: [
      { id: "a", option: "在企业微信的聊天窗口中打开语音通话功能。" },
      { id: "b", option: "在企业微信的通讯录中查找语音通话功能。" },
      { id: "c", option: "在企业微信的文件应用程序中使用语音通话功能。" },
    ],
  },
  {
    id: 13,
    question: "如何在企业微信中使用实时视频通话？",
    options: [
      { id: "a", option: "在企业微信的聊天窗口中打开视频通话功能。" },
      { id: "b", option: "在企业微信的通讯录汇总查找视频通话功能。" },
      { id: "c", option: "在企业微信的文件应用程序中使用视频通话功能。" },
    ],
  },
  {
    id: 14,
    question: "如何在企业微信中共享文件？",
    options: [
      { id: "a", option: "在企业微信的聊天窗口中共享文件。" },
      { id: "b", option: "在企业微信的通讯录中共享文件。" },
      { id: "c", option: "在企业微信的文件应用程序中共享文件。" },
    ],
  },
  {
    id: 15,
    question: "如何在企业微信中使用日程功能？",
    options: [
      { id: "a", option: "在b.在企业微信的通讯录中使用日程功能。" },
      { id: "b", option: "在企业微信的聊天窗口中使用日程功能。" },
      { id: "c", option: "在企业微信的日程应用程序中使用日程功能。" },
    ],
  },
  {
    id: 16,
    question: "如何在企业微信中创建日程？",
    options: [
      {
        id: "a",
        option: "在企业微信中点击“钉钉日历”图标，然后在弹出的页面中创建日程。",
      },
      {
        id: "b",
        option: "在在企业微信中点击“文件”图标，然后在弹出的页面中创建日程。",
      },
      {
        id: "c",
        option: "在企业微信中点击“日程”图标，然后在弹出的页面中创建日程。",
      },
    ],
  },
  {
    id: 17,
    question: "如何在企业微信中删除日程？",
    options: [
      { id: "a", option: "在企业微信的聊天窗口中删除日程。" },
      { id: "b", option: "在企业微信的通讯录中删除日程。" },
      { id: "c", option: "在企业微信的日程应用程序中删除日程。" },
    ],
  },
  {
    id: 18,
    question: "如何在企业微信中修改日程？",
    options: [
      { id: "a", option: "在企业微信的聊天窗口中修改日程。" },
      { id: "b", option: "在企业微信的日程应用程序中修改日程。" },
      { id: "c", option: "在企业微信的通讯录中修改日程。" },
    ],
  },
  {
    id: 19,
    question: "如何在企业微信中查看日程安排？",
    options: [
      { id: "a", option: "在企业微信的聊天窗口中查看日程安排。" },
      { id: "b", option: "在企业微信的通讯录中查看日程安排。" },
      { id: "c", option: "在企业微信的日程应用程序中查看日程安排。" },
    ],
  },
  {
    id: 20,
    question: "如何在企业微信中创建汇报？",
    options: [
      { id: "a", option: "在企业微信的工作台中创建汇报。" },
      { id: "b", option: "在企业微信的聊天窗口中创建汇报。" },
      { id: "c", option: "在企业微信的通讯录中创建汇报。" },
    ],
  },
];
export const anwsers = [
  "c",
  "c",
  "a",
  "c",
  "a",
  "b",
  "c",
  "a",
  "b",
  "a",
  "a",
  "a",
  "a",
  "c",
  "a",
  "c",
  "a",
  "b",
  "c",
  "a",
];

const exam = {
  title: "企业微信考试",
  questions,
  anwsers,
};

export default exam;
